<?php
/**
 * 系统数据字典
 */

//城市
$config['attrCity'] = array(
	'A'		=> array(
		1		=> '北京',
		2		=> '上海',
		3		=> '广州',
		4		=> '深圳',
	),
	'B'		=> array(
		5		=> '杭州',
		7		=> '嘉兴',
		8		=> '桐乡',
		9		=> '海宁',
		10		=> '宁波',
		11		=> '温州',
		12		=> '湖州',
		13		=> '常熟',
		14		=> '厦门',
		15		=> '晋江',
		16		=> '石狮',
	),
	'C'		=> array(
		17		=> '苏州',
		18		=> '无锡',
		19		=> '南京',
		20		=> '武汉',
		21		=> '郑州',
		22		=> '成都',
		23		=> '重庆',
		24		=> '佛山',
		25		=> '东莞',
		26		=> '中山',
		27		=> '汕头',
	),
	'D'		=> array(
		28		=> '义乌',
		29		=> '平湖',
		30		=> '嵊州',
		31		=> '长沙',
		32		=> '济南',
		33		=> '烟台',
		34		=> '沈阳',
	),
);

//薪水
$config['attrSalary'] = array(
	1		=> '3000以下',
	2		=> '3000-5000',
	3		=> '5001-8000',
	4		=> '8001-15000',
	5		=> '15001-20000',
	6		=> '20001 以上',
	0		=> '面议',
);

//企业性质
$config['attrNature'] = array(
	1		=> '上市企业',
	2		=> '民营企业',
	3		=> '外资企业',
	4		=> '合资企业',
	5		=> '国资企业',
);

//企业规模
$config['attrScale'] = array(
	1		=> '15 人以下',
	2		=> '15-50 人',
	3		=> '51-100 人',
	4		=> '101-300 人',
	5		=> '301-500 人',
	6		=> '501-1000 人',
	7		=> '1001-2000 人',
	8		=> '2001 人以上',
);

$config['attrEducation'] = array(
	1		=> '博士',
	2		=> '硕士',
	3		=> '本科',
	4		=> '大专',
	5		=> '中专',
	6		=> '高中',
	7		=> '其他',
);

//服装品类
$config['attrClothCat'] = array(
	1		=> '男装',
	2		=> '女装',
	3		=> '童装',
	4		=> '运动(户外)',
	5		=> '大众休闲',
	6		=> '内衣(家居服)',
	7		=> '羽绒',
	8		=> '毛衫',
	9		=> '皮草',
	10		=> '裤业',
	11		=> '牛仔',
	12		=> '婚纱',
);

$config['attrYears'] = array(
	1		=> '1年',
	2		=> '2年',
	3		=> '3年',
	4		=> '4年',
	5		=> '5年',
	6		=> '6年',
	7		=> '7年',
	8		=> '8年',
	9		=> '9年',
	10		=> '10年及以上',
	0		=> '不限',
);

/**
 * 职位
 * 关于level的说明： 
 * 	1. 总监及以上  简历不可下载
 * 	2. 主管级  简历下载60飞石币
 * 	3. 经理级  简历下载30飞石币
 * 	4. 基层级  简历下载15飞石币
 */
$config['attrJobs'] = array(
	1		=> array(
		'name'		=> '产品类',
		'children'	=> array(
			4	=> array(
				'name'	=> '商品企划总监',
				'level'	=> 1,
			),
			5	=> array(
				'name'	=> '商品企划经理',
				'level'	=> 2,
			),
			6	=> array(
				'name'	=> '商品企划管',
				'level'	=> 3,
			),
			7	=> array(
				'name'	=> '买手',
				'level'	=> 4,
			),
			8	=> array(
				'name'	=> '产品总监',
				'level'	=> 1,
			),
			9	=> array(
				'name'	=> '产品经理',
				'level'	=> 2,
			),
			10	=> array(
				'name'	=> '产品主管',
				'level'	=> 3,
			),
			11	=> array(
				'name'	=> '产品专员',
				'level'	=> 4,
			),
		),
	),
	2		=> array(
		'name'		=> '设计类',
		'children'	=> array(
			12	=> array(
				'name'	=> '设计总监',
				'level'	=> 1,
			),
			13	=> array(
				'name'	=> '设计经理',
				'level'	=> 2,
			),
			14	=> array(
				'name'	=> '设计主管',
				'level'	=> 3,
			),
			15	=> array(
				'name'	=> '首席设计师',
				'level'	=> 4,
			),
			16	=> array(
				'name'	=> '主设计师',
				'level'	=> 4,
			),
			15	=> array(
				'name'	=> '设计师',
				'level'	=> 4,
			),
			16	=> array(
				'name'	=> '设计助理',
				'level'	=> 4,
			),
			17	=> array(
				'name'	=> '梭织设计师',
				'level'	=> 4,
			),
			18	=> array(
				'name'	=> '针织设计师',
				'level'	=> 4,
			),
			19	=> array(
				'name'	=> '毛织设计师',
				'level'	=> 4,
			),
			20	=> array(
				'name'	=> '面料设计师',
				'level'	=> 4,
			),
			21	=> array(
				'name'	=> '图案设计师',
				'level'	=> 4,
			),
			22	=> array(
				'name'	=> '配饰设计师',
				'level'	=> 4,
			),
		),
	),
	3		=> array(
		'name'		=> '视觉类',
		'children'	=> array(
			23	=> array(
				'name'	=> '视觉形象设计总监',
				'level'	=> 1,
			),
			24	=> array(
				'name'	=> '视觉形象设计主管',
				'level'	=> 2,
			),
			25	=> array(
				'name'	=> '视觉形象设计经理',
				'level'	=> 3,
			),
			26	=> array(
				'name'	=> '陈列总监',
				'level'	=> 1,
			),
			27	=> array(
				'name'	=> '陈列主管',
				'level'	=> 2,
			),
			28	=> array(
				'name'	=> '陈列经理',
				'level'	=> 3,
			),
			29	=> array(
				'name'	=> '陈列师',
				'level'	=> 4,
			),
			30	=> array(
				'name'	=> '平面设计总监',
				'level'	=> 1,
			),
			31	=> array(
				'name'	=> '平面设计主管',
				'level'	=> 2,
			),
			32	=> array(
				'name'	=> '平面设计经理',
				'level'	=> 3,
			),
			33	=> array(
				'name'	=> '平面设计师',
				'level'	=> 4,
			),
			34	=> array(
				'name'	=> '空间设计总监',
				'level'	=> 1,
			),
			35	=> array(
				'name'	=> '空间设计主管',
				'level'	=> 2,
			),
			36	=> array(
				'name'	=> '空间设计经理',
				'level'	=> 3,
			),
			37	=> array(
				'name'	=> '空间设计师',
				'level'	=> 4,
			),
			38	=> array(
				'name'	=> '道具设计是',
				'level'	=> 4,
			),
			39	=> array(
				'name'	=> '舞美设计师',
				'level'	=> 4,
			),
		),
	),
);


